Revit found one or more elements with multiple connectors. Select each element and then select the connectors to use for the analytical connection.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId ElementHasMultipleConnectors { get; }
  Visual Basic
Public Shared ReadOnly Property ElementHasMultipleConnectors As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ElementHasMultipleConnectors {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConnectorFailures Class
  Autodesk.Revit.DB Namespace